//TSTADDP3 JOB (ACCT#),'FERNAND',MSGCLASS=H,REGION=4M,
//             CLASS=A,MSGLEVEL=(1,1),NOTIFY=&SYSUID,TIME=(0,5),
//             COND=(4,LT)
//*
//         JCLLIB  ORDER=SDJ.FORM.PROCLIB
//*
//COMPCIC  EXEC COMPCICS
//STEPCIC.SYSIN    DD DSN=API7.SOURCE.COBOL(TSTADDP3),DISP=SHR
//STEPCOB.SYSLIB   DD
//                 DD
//                 DD DSN=API7.SOURCE.COPY,DISP=SHR
//EXEC    EXEC PGM=IKJEFT01
//STEPLIB  DD DSN=&SYSUID..SOURCE.PGMLIB,DISP=SHR
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
    DSN SYSTEM (DSN1)
    RUN PROGRAM(TSTADDP3)
/*